In [2]:
import pandas as pd

In [8]:
path = '/Users/rajatdhawale/Desktop/ML_Learning/Preprocessing/data/Salary_data.csv'

In [10]:
df = pd.read_csv(path)

In [12]:
df.head

<bound method NDFrame.head of      employee_id   employee_name  experience_years  num_certifications  \
0       EMP99239     Fiona Jones                 2                   2
1       EMP78421     Diana Jones                 7                   0
2       EMP97839     Diana Jones                14                   3
3       EMP48127  Diana Williams                 4                   0
4       EMP30685    Hannah Smith                 2                   5
...          ...             ...               ...                 ...
9995    EMP27240   Hannah Miller                20                   1
9996    EMP80210     Alice Jones                 9                   1
9997    EMP65072    Hannah Jones                 3                   1
9998    EMP59550     Alice Davis                 4                   1
9999    EMP99419   Ivan Williams                 4                   4

     education_level   skill_level       industry    salary
0        high school      beginner  MANUFACTURING  17990.98
1                phd      advanced        Finance  22203.61
2                PhD  Intermediate     healthcare  43783.52
3                PHD      ADVANCED  manufacturing  23767.45
4        High School      BEGINNER     healthcare  30427.86
...              ...           ...            ...       ...
9995             phd      Beginner  MANUFACTURING  43966.81
9996       bachelors      Advanced  Manufacturing  29826.46
9997             PHD      advanced  MANUFACTURING  25141.86
9998         Masters      BEGINNER             It  19948.28
9999     HIGH SCHOOL      beginner        FINANCE  27687.30

[10000 rows x 8 columns]>

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   employee_id         10000 non-null  object
 1   employee_name       10000 non-null  object
 2   experience_years    10000 non-null  int64
 3   num_certifications  10000 non-null  int64
 4   education_level     10000 non-null  object
 5   skill_level         10000 non-null  object
 6   industry            10000 non-null  object
 7   salary              10000 non-null  float64
dtypes: float64(1), int64(2), object(5)
memory usage: 625.1+ KB

In [16]:
df.describe()

       experience_years  num_certifications        salary
count      10000.000000        10000.000000  10000.000000
mean          10.076700            2.511300  35755.627205
std            6.032931            1.713524  11498.153689
min            0.000000            0.000000  15000.000000
25%            5.000000            1.000000  27002.350000
50%           10.000000            3.000000  35827.755000
75%           15.000000            4.000000  44293.207500
max           20.000000            5.000000  59040.579000

In [20]:
df.industry.unique()

array(['MANUFACTURING', 'Finance', 'healthcare', 'manufacturing', 'it',
       'Manufacturing', 'IT', 'Healthcare', 'FINANCE', 'finance',
       'HEALTHCARE', 'It'], dtype=object)

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   employee_id         10000 non-null  object
 1   employee_name       10000 non-null  object
 2   experience_years    10000 non-null  int64
 3   num_certifications  10000 non-null  int64
 4   education_level     10000 non-null  object
 5   skill_level         10000 non-null  object
 6   industry            10000 non-null  object
 7   salary              10000 non-null  float64
dtypes: float64(1), int64(2), object(5)
memory usage: 625.1+ KB

In [24]:
df.employee_id.nunique()

9539

In [26]:
df.experience_years.unique()

array([ 2,  7, 14,  4, 18,  0,  1, 13, 10, 15,  3, 19, 20, 17,  6,  9, 11,
        5,  8, 16, 12])

AttributeError: 'SeriesGroupBy' object has no attribute 'trnasform'